Ricardo-1115/FlexSense_Project/04-Firmware_Code/sdkconfig.defaults
# ESP32-S3 target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# Enable console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Optimize for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# Enable logs
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
